# HasValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..HasValue Property
Parameter Class See Also
---
Identifies if the parameter has an assigned value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool HasValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasValue As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasValue {
	bool get ();
}
```

# See Also
Parameter Class
Autodesk.Revit.DB Namespace